app/controllers/contact_shares_controller.rb

INSERT INTO "contact_shares" ("user_id", "contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["contact_id", 1], ["created_at", "2015-09-15 00:09:00.017457"], ["updated_at", "2015-09-15 00:09:00.017457"]]
---
  def create
    contact_share = ContactShare.new(contact_share_params)
    if contact_share.save!

SELECT  "contact_shares".* FROM "contact_shares" WHERE "contact_shares"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "contact_shares" WHERE "contact_shares"."id" = $1  [["id", 8]]
---
  def destroy
    contact_share =  ContactShare.find(params[:id])
    contact_share.destroy!