app/controllers/contacts_controller.rb

  def show
    contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    contact = Contact.find(params[:id])

    if contact.update!(contact_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "contacts" SET "email" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["email", "sammy@gmail.com"], ["updated_at", "2015-09-14 23:37:07.047068"], ["id", 3]]

  def destroy
    contact = Contact.find(params[:id])
    contact.destroy!
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 5]]