app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Gizmo"], ["email", "gizmo@gizmo.gizmo"], ["created_at", "2015-09-14 21:11:39.978571"], ["updated_at", "2015-09-14 21:11:39.978571"]]

  def update
    user = User.find(params[:id])

    if user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "andy"], ["updated_at", "2015-09-14 22:39:52.839877"], ["id", 1]]

  def destroy
    user = User.find(params[:id])
    user.destroy!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]